const exponentiation = (x, n) => x ** n;

console.log(exponentiation(5, -2));

// Проверка натурального числа
// function nat(n) {
//     return n >= 0 && Math.floor(n) === +n;
// }
//
// console.log(nat(-6));

// Напишите функцию, которая принимает два натуральных числа x и n и
// возвращает x в степени n. Иначе говоря, умножает x на себя n раз и
// возвращает результат.
// Используйте Arrow Function синтаксис.
// Протестируйте функцию на любых значениях и выведите результат в консоль.
// exponentiation
